
#!/bin/bash
# FigTaiwan 開發環境
# 適用於: Ubuntu 20.04
# Version 0.1:	2020.12.07
#   01. 基礎系統設定 
#   02. 常用軟體安裝
#   03. 中文系統設定與安裝中文字型
# 備註:
# =============================================================================
# 更新套件
# =============================================================================
sudo apt-get update
sudo apt-get upgrade -y
# =============================================================================
# 安裝必要套件
# =============================================================================
sudo apt-get install -y vim git htop
sudo apt autoremove -y
# =============================================================================
# 設定 vim 套件管理系統
# =============================================================================
git clone https://github.com/VundleVim/Vundle.vim.git ~/.vim/bundle/Vundle.vim
# 載入 myFocalFossa 專案，裡面有常用的設定檔與資料檔 
git clone https://github.com/r4forth/myFocalFossa.git
# 複製 vimrc，讓 vim 使用比較便利
cp ~/myFocalFossa/vimrc ~/.vimrc
# =============================================================================
# 常用軟體安裝
# =============================================================================
# 1. 文字編輯器 VSCode
# 2. VLC
# 3. 看圖軟體
# 4. 抓圖軟體
# 5. 檔案傳輸軟體

